app/views/users/resume1.html.erb

	<section class="tags"><h2>Skills</h2>
<% @user.skills.each do |skill| %>
---
SELECT "skills".* FROM "skills" WHERE "skills"."user_id" = 1

			<ul>
<% @user.experiences.each do |exp| %>
---
SELECT "experiences".* FROM "experiences" WHERE "experiences"."user_id" = 1

			<ul>
<% @user.schools.each do |school| %>
---
SELECT "schools".* FROM "schools" WHERE "schools"."user_id" = 1

			<ul>
<% @user.achievements.each do |a| %>
---
SELECT "achievements".* FROM "achievements" WHERE "achievements"."user_id" = 1