app/views/users/resume2.html.erb

			<ul>
				<% @user.skills.each do |skill| %>
---
SELECT "skills".* FROM "skills" WHERE "skills"."user_id" = 6


<% @user.experiences.each do |exp| %>
---
SELECT "experiences".* FROM "experiences" WHERE "experiences"."user_id" = 6


<% @user.schools.each do |school| %>
---
SELECT "schools".* FROM "schools" WHERE "schools"."user_id" = 6


<% @user.achievements.each do |a| %>
---
SELECT "achievements".* FROM "achievements" WHERE "achievements"."user_id" = 6