app/views/welcome/index.html.erb

SELECT "testimonials".* FROM "testimonials" WHERE "testimonials"."id" = ? LIMIT 1  [["id", -1]]
---

      <% t = Testimonial.find(rand(Testimonial.count) + 1)