app/controllers/api/v1/peoples_controller.rb

      def index
        users = User.select { |i| i[:firstname].to_s + i[:lastname].to_s == params[:name] }
---
SELECT "users".* FROM "users" WHERE "users"."firstname" = 'saga' AND "users"."lastname" = 'saga'