app/controllers/api/v1/skills_controller.rb

      def index
        render xml: Skill.all
---
SELECT "skills".* FROM "skills"