app/controllers/api/v1/testimonials_controller.rb

SELECT "testimonials".* FROM "testimonials"
---
      def index
        render xml: Testimonial.all