app/controllers/achievements_controller.rb

  def edit
    @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]

  def create
    params[:achievement][:user_id] = session[:user_id]
    @achievement = Achievement.new(params[:achievement])

    respond_to do |format|
      if @achievement.save
---
INSERT INTO "achievements" ("created_at", "description", "updated_at", "user_id", "year") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 14 Sep 2013 18:08:50 CDT -05:00], ["description", "J2SE "], ["updated_at", Sat, 14 Sep 2013 18:08:50 CDT -05:00], ["user_id", 6], ["year", 2013]]