app/controllers/experiences_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
---
  def edit
    @user = User.find(session[:user_id])