app/controllers/feedbacks_controller.rb

  def create
    @feedback = Feedback.new(params[:feedback])
    if @feedback.save
---
INSERT INTO "feedbacks" ("created_at", "description", "updated_at", "who") VALUES (?, ?, ?, ?)