app/controllers/resume_templates_controller.rb

SELECT "resume_templates".* FROM "resume_templates"
SELECT "resume_templates".* FROM "resume_templates" WHERE "resume_templates"."id" = ? LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
---
  def index
    @resume_templates = ResumeTemplate.all
    @selected = ResumeTemplate.find(User.find(session[:user_id]).resume_template).name