app/controllers/schools_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
---
  def edit
    @user = User.find(session[:user_id])

INSERT INTO "schools" ("created_at", "desc", "from", "name", "to", "updated_at", "user_id", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    params[:school][:user_id] = session[:user_id]
    @school = School.new(params[:school])

    respond_to do |format|
      if @school.save