app/controllers/skills_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @user = User.find(session[:user_id])

INSERT INTO "skills" ("created_at", "name", "skill_category_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 14 Sep 2013 18:08:23 CDT -05:00], ["name", "PHP"], ["skill_category_id", "Programming Languages"], ["updated_at", Sat, 14 Sep 2013 18:08:23 CDT -05:00], ["user_id", 6]]
---
  def create
    params[:skill][:user_id] = session[:user_id]
    @skill = Skill.new(params[:skill])

    respond_to do |format|
      if @skill.save