app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "views" = 1, "updated_at" = '2013-09-14 23:12:18.212164' WHERE "users"."id" = 6
---
  def resume
    @user = User.find(params[:id])
    if( @user )

      if(@user.sharing == "Restricted" && session[:user_id] == nil)
        flash[:error] = "You can view this resume only if you are logged in"
        redirect_to "/welcome/index"
        return
      end

      if(@user.sharing == "Private" && session[:user_id] != @user.id)
        flash[:error] = "You can view this resume only if you are logged in"
        redirect_to "/welcome/index"
        return
      end

      if(session[:user_id] != @user.id)
        @user.views = @user.views + 1
        @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "users" SET "sharing" = 'Private', "updated_at" = '2013-09-15 02:24:33.953769' WHERE "users"."id" = 5
---
  def changesharing
    @user = User.find(session[:user_id])
    if( @user )
      @user.sharing = params[:sharing][:type]
      if( @user.save )

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
---
  def sharing
    @user = User.find(session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "users" SET "resume_template" = 2, "updated_at" = '2013-09-14 23:11:08.105743' WHERE "users"."id" = 6
---
  def changetemplate
    @user = User.find(session[:user_id])
    if( @user )
      @user.resume_template = params[:id]
      if( @user.save )

SELECT "users".* FROM "users" WHERE "users"."id" = 5 AND "users"."password_hash" = 'f10e2821bbbea527ea02200352313bc059445190' LIMIT 1
---
  def dochangepassword
    begin
      if params[:oldpassword].blank? || params[:password].blank? || params[:confirmpassword].blank?
        raise "Please complete the form."
      end
      if params[:password] != params[:confirmpassword]
        raise "Passwords should match"
      end

      user = User.where(:id => session[:user_id], :password_hash => Digest::SHA1.hexdigest( params[:oldpassword] )).first

SELECT "tmpusers".* FROM "tmpusers" WHERE "tmpusers"."email" = 'anirudh.bhargava@sv.cmu.edu' AND "tmpusers"."code" = '4edeb2c7dd7ad7379ca08ed84fa8963e85dbc696' LIMIT 1
INSERT INTO "users" ("created_at", "email", "firstname", "lastname", "likes", "mobile", "password_hash", "resume_template", "sharing", "updated_at", "views") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
DELETE FROM "tmpusers" WHERE "tmpusers"."id" = ?  [["id", 23]]
---
  def confirmuser
    begin
      if params[:password].blank? || params[:confirmpassword].blank? || params[:email].blank? || params[:code].blank?
        raise "Please complete the form. Please retry."
      end
      if params[:password] != params[:confirmpassword]
        raise "Passwords should match"
      end

      @tmpuser = Tmpuser.where(email: params[:email], code: params[:code]).first
      raise "User not found" if (nil == @tmpuser)
      user = User.new(:email => @tmpuser[:email], :firstname => @tmpuser[:firstname], :password_hash => Digest::SHA1.hexdigest( params[:password] ), :views => 0, :resume_template => 1, :sharing => "Open")
      raise "User couldn't be created. Contact the admin." if (!user.save)
      @tmpuser.destroy

SELECT "tmpusers".* FROM "tmpusers" WHERE "tmpusers"."email" = 'anirudh.bhargava@sv.cmu.edu' AND "tmpusers"."code" = '4edeb2c7dd7ad7379ca08ed84fa8963e85dbc696' LIMIT 1
---
  def confirmemail
    begin
      @tmpuser = Tmpuser.where(email: params[:email], code: params[:code]).first

SELECT "users".* FROM "users" WHERE "users"."email" = 'anirudh.bhargava@west.cmu.edu' LIMIT 1
INSERT INTO "tmpusers" ("code", "created_at", "email", "firstname", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def newtmp
    tmpuser = params[:tmpuser]
    if tmpuser[:email].blank? || tmpuser[:firstname].blank?
      flash[:error] = "All fields are mandatory"
    else

      user = User.where(email: tmpuser[:email]).first
      if(user)
        flash[:error] = "This exists a user with this email already"
      else
        newUser = Tmpuser.create(:email => tmpuser[:email], :firstname => tmpuser[:firstname], :code => Digest::SHA1.hexdigest( tmpuser[:email] + tmpuser[:firstname] + Time.now.to_s + rand(10000).to_s ) )

SELECT "users".* FROM "users" WHERE "users"."email" = 'sagarbhosale019@gmail.com' AND "users"."password_hash" = '3da541559918a808c2402bba5012f6c60b27661c' LIMIT 1
---
  def authenticate
      user = User.where(email: params[:user][:email], password_hash: Digest::SHA1.hexdigest( params[:user][:password] ))

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @user = User.find(session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "users" SET "lastname" = 'Bhargava', "mobile" = '', "updated_at" = '2013-09-14 23:07:39.509519' WHERE "users"."id" = 6
---
  def update
    @user = User.find(session[:user_id])

    respond_to do |format|
      if @user.update_attributes(params[:user])