app/controllers/welcome_controller.rb

SELECT "testimonials".* FROM "testimonials"
---
	def index
		@testimonials = Testimonial.all